<!-- dflook/terraform-github-actions {"workspace":"kub1k","backend_type":"local","backend":"b9a6e14cc18ee3b5417f6d85276e37a4e13ae1448e3c126ea81ed35487a71a3c","plan_job_ref":"Job Terraform Plan #104 at https://github.com/ironashram/kub1k/actions/runs/12210902726","plan_out_hash":"5ab58b41beff241a5ef213e8ae215721aa292d81a0126b24846a5e087de53944","plan_hash":"66d4c60ed633ee7aacf06095e6f4079f4035297ace36d842f6a6a5340afa90f3","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__ in the __kub1k__ workspace
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.provision_apps[0].helm_release.argocd will be updated in-place
!~  resource "helm_release" "argocd" {
        id                         = "argocd"
        name                       = "argocd"
!~      version                    = "7.7.6" -> "7.7.7"
#        (27 unchanged attributes hidden)

#        (5 unchanged blocks hidden)
    }

  # module.provision_k3s.data.local_sensitive_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_sensitive_file" "kubeconfig" {
+       content              = (sensitive value)
+       content_base64       = (sensitive value)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       filename             = "/github/home/.kube/config-files/kub1k.yaml"
+       id                   = (known after apply)
    }

  # module.provision_k3s.null_resource.k3s_kubeconfig must be replaced
-/+ resource "null_resource" "k3s_kubeconfig" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "timestamp" = "2024-12-03T20:40:19Z" -> (known after apply)
        }
    }

  # module.provision_k3s.vault_kv_secret_v2.k3s will be updated in-place
!~  resource "vault_kv_secret_v2" "k3s" {
!~      data_json           = (sensitive value)
        id                  = "kv/data/kub1k/k3s"
        name                = "kub1k/k3s"
#        (6 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #104](https://github.com/ironashram/kub1k/actions/runs/12210902726)